Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: * |instrument <quantity list> <description>| = description of the instrument that was used to survey the given quantities (same keywords as team person's role) * |infer <what> <on/off>| = `|infer plumbs on|' tells the program to interpret gradients $90 ^$ as UP/DOWN (this means no clino corrections are applied).
ru_ru: * |instrument <инструмент> <описание>| = описание инструмента, который\break использовался для определения количественных данных (те же значения, что и роль человека в команде). * |infer <что> <on/off>| = `|infer plumbs on|' говорит программе\break интерпретировать угол наклона $90 ^$ как UP/DOWN (это означает, что угол наклона не будет изменяться при раскидывании невязки).\break

source: * |lat-long|, |long-lat| = latitude (N positive, S negative) and longitude (E positive, W negative) in given order in degrees ($deg[{:}min[{:}sec]]$ allowed), WGS84 datum.
ru_ru: * |lat-long|, |long-lat| = Широта (N положительная, S отрицательная) и долгота\break (E положительная, W отрицательная) в заданном порядке в градусах\break (разрешено $deg[{:}min[{:}sec]]$), WGS84.

source: * |layout <id>| = use predefined map or atlas layout.
ru_ru: * |layout <идентификатор>| = использовать предопределенный макет карты или атласа.

source: * |layout-xxx| = where |xxx| stands for other layout options.
ru_ru: * |layout-xxx| = где |xxx| означает другие опции макета.

source: * |legend-width <n> <units>| = legend width (M, A; default: |14 cm|) * |legend <on/off/all>| = display list of used map symbols in the map header.
ru_ru: * |legend-width <n> <единицы>| = ширина легенды (M, A; по умолчанию: |14 см|). * |legend <on/off/all>| = отобразить список используемых символов карты в заголовке карты.

source: * |location <on/(off)>| = set whether to export coordinates of cave entrances in the table.
ru_ru: * |location <on/(off)>| = указать, следует ли экспортировать координаты\break входов пещеры в таблицу.

source: * |map-header <x> <y> <off/n/s/e/w/ne/nw/se/sw/center>| = print map header at location specified by |<x> <y>|.
ru_ru: * |map-header <x> <y> <off/n/s/e/w/ne/nw/se/sw/center>| = напечатать\break заголовок карты в месте, указанном координатами |<x> <y>|.\break

source: * |map-level <number>| = valid only when a map is selected.
ru_ru: * |map-level <число>| = действует только при выборе карты.

source: * |mpost-options <string>|
ru_ru: * |mpost-options <текст>|

source: * |mpost-path <file-path>|
ru_ru: * |mpost-path <путь файла>|

source: * |name <reference>| = if the point type is station, this option gives the reference to the real survey station.
ru_ru: * |name <ссылка>| = если тип точки -- это station (станция), то эта опция дает ссылку на реальную станцию съемки.

source: * |namespace <on/off>| = specify whether survey creates namespace (|on| by default) * |declination <specification>| = set the default declination for all data objects in this survey (which can be overridden by declination definitions in subsurveys).
ru_ru: * |namespace <on/off>| = указывает, создавать ли survey пространство имен (|on| по умолчанию). * |declination <спецификация>| = устанавливает склонение по умолчанию для всех объектов данных в этом survey (которые могут быть переопределены новым склонением в suburveys).

source: * |orientation/orient <number>| = defines the orientation of the symbol.
ru_ru: * |orientation/orient <число>| = определяет ориентацию символа.

source: * |orientation/orient <number>| = orientation of the symbols on the line.
ru_ru: * |orientation/orient <число>| = ориентация символов на линии.

source: * |outline <in/out/none>| = determines whether the line serves as a border line for a scrap.
ru_ru: * |outline <in/out/none>| = определяет, служит ли линия границей скрапа.

source: * |pdftex-path <file-path>|
ru_ru: * |pdftex-path <путь файла>|

source: * |person-rename <old name> <new name>| = rename a person whose name has been changed
ru_ru: * |person-rename <старое имя> <новое имя>| = переименовать человека, имя которого было изменено.

source: * |place <bottom/default/top>| = changes displaying order in the map.
ru_ru: * |place <bottom/default/top>| = порядок отображения изменений на карте.

source: * |projection <id>| = unique identifier that specifies the map projection type.
ru_ru: * |projection <идентификатор>| = уникальный идентификатор, который задает тип проекции карты

source: * |projection <specification>| = specifies the drawing projection.
ru_ru: * |projection <спецификация>| = указывает проекцию чертежа.

source: * |projection/proj <plan/elevation/extended/none>| = required if the map contains survey.
ru_ru: * |projection/proj <plan/elevation/extended/none>| = требуется, если карта\break содержит съемки.

source: * |recursive <on/off>| = valid only when a survey is selected.
ru_ru: * |recursive <on/off>| = действует только при выборе съемки.

source: * |scale <picture length> <real length>| = set scale of output map or map atlas (M, A; default: |1 200|) * |base-scale <picture length> <real length>| = if set, Therion will optically scale the map by a (|scale/base-scale|) factor.
ru_ru: * |scale <длина изображения> <реальная длина>| = устанавливает масштаб выходной карты или атласа (M, A; по умолчанию: |1 200|). * |base-scale <длина изображения> <реальная длина>| = если установлено, Therion будет масштабировать карту с коэффициентом (|scale/base-scale|).

source: * |scale <specification>| = is used to pre-scale (convert coordinates from pixels to meters) the scrap data.
ru_ru: * |scale <спецификация>| = используется для предварительного\break масштабирования (преобразования координат пикселей в метры) данных скрапа.

source: * |scale| = symbol scale, can be: tiny (xs), small (s), normal (m), large (l), huge (xl) or a numeric value.
ru_ru: * |scale| = масштаб символа, может принимать значения: tiny (xs), small (s), normal (m), large (l), huge (xl) или числовое значение.

source: * |scrap <reference>| = if the point type is section, this is a reference to a cross-section scrap.
ru_ru: * |scrap <сноска>| = если тип точки -- это section (сечение), то эта сноска ссылается на скрап поперечного сечения.

source: * |sd <quantity list> <value> <units>| = sets the standard deviation for the given measurements.
ru_ru: * |sd <параметр> <значение> <единицы>| = задает стандартное\break отклонение для данных измерений.

source: * |setup3d <value>|
ru_ru: * |setup3d <значение>|

source: * |size <number>| = line width (left and right sizes are set to one half of this value) * |r-size <number>| = size of the line to the right * |l-size <number>| = same to the left.
ru_ru: * |size <число>| = ширина линии (размеры слева и справа установлены\break половине этого значения). * |r-size <число>| = размер линии справа. * |l-size <число>| = размер линии слева.

source: * |size <width> <height> <units>| = set map size in the atlas mode.
ru_ru: * |size <ширина> <высота> <единицы>| = задает размер карты в режиме атласа.

source: * |sketch <filename> <x> <y>| = underlying sketch bitmap specification (lower left corner coordinates).
ru_ru: * |sketch <имя файла> <x> <y>| = определение растрового рисунка в качестве эскиза/подложки (координаты нижнего левого угла).

source: * |sketch-colors <number-of-colors>|
ru_ru: * |sketch-colors <число цветов>|

source: * |sketch-warp <algorithm>|
ru_ru: * |sketch-warp <алгоритм>|

source: * |smooth <on/off/auto>| = whether the line is smooth at the given point.
ru_ru: * |smooth <on/off/auto>| = сглаживание линии в данной точке.

source: * |smooth <on/off>| indicates whether two lines are to be connected smoothly.
ru_ru: * |smooth <on/off>| = указывает, должны ли две линии соединяться плавно.

source: * |source-path <directory>|
ru_ru: * |source-path <каталог>|

source: * |station <station> <comment> [<flags>]| = set the station comment and its flags.
ru_ru: * |station <станция> <комментарий> [<флаги>]| = установить комментарий станции и ее флаги.

source: * |station-names <prefix> <suffix>| = adds given prefix/suffix to all survey stations in the current centreline.
ru_ru: * |station-names <префикс> <суффикс>| = добавляет данный\break префикс/суффикс для всех станций съемки в текущей нитки хода.

source: * |subtype <keyword>| = determines line subtype.
ru_ru: * |subtype <подтип>| = определяет подтип линии.

source: * |subtype <keyword>| = determines the object's subtype.
ru_ru: * |subtype <подтип>| = определяет подтип объекта.

source: * |survey-level <N/all>| = |N| is the number of survey levels displayed next to the station name (M, A; default: |0|).
ru_ru: * |survey-level <N/all>| = |N| -- количество уровней съемки, отображаемых рядом с именем станции (M, A; по умолчанию: |0|).

source: * |surveys (create)/use/ignore| = specifies how to import survey structure (works only with .3d files).
ru_ru: * |surveys (create)/use/ignore| = указывает, как импортировать структуру\break съемки (работает только с файлами .3d).

source: * |symbol-hide <point/line/area/group/special> <symbol-type>| = don't display particular symbol or group of symbols.
ru_ru: * |symbol-hide <point/line/area/group/special> <тип символа>| = не\break отображать конкретный символ или группу символов.

source: * |team <person> [<roles>]| = a survey team member.
ru_ru: * |team <персона> [<роли>]| = член съемочного отделения.

source: * |tex-fonts <encoding> <rm> <it> <bf> <ss> <si>|
ru_ru: * |tex-fonts <кодировка> <rm> <it> <bf> <ss> <si>|

source: * |tex-fonts-optional <encoding> <rm> <it> <bf> <ss> <si>|
ru_ru: * |tex-fonts-optional <кодировка> <rm> <it> <bf> <ss> <si>|

source: * |text <language ID> <therion text> <my text>|
ru_ru: * |text <ID языка> <текст Therion'а> <свой текст>|

source: * |text <string>| = valid only for label lines.
ru_ru: * |text <строка>| = действует только для линий надписей.

source: * |text| = text of the label, remark or continuation.
ru_ru: * |text| = текст label (текстовая метка), remark (замечание) или continuation (продолжение, возможное продолжение).

source: * |title <string>| = description of the object
ru_ru: * |title <строка>| = описание объекта.

source: * |title <string>| = description of the object * |survey <id>| ={5.4} associate a survey with map (e.g.all surveying statistics from this survey will be used when this map is selected for output).
ru_ru: * |title <строка>| = описание объекта. * |survey <идентификатор>| = {5.4} связывает съемку с картой (например,все\break статистические данные из этой съемки будут использоваться, когда эта карта будет выбрана для вывода).

source: * |tmp-path <directory>|
ru_ru: * |tmp-path <каталог>|

source: * |tmp-remove <OS command>|
ru_ru: * |tmp-remove <команда ОС>|

source: * |units <quantity list> [<factor>] <units>| = set the units for given measurements (same quantities as for sd).
ru_ru: * |units <параметр> [<фактор>] <единицы>| = устанавливает единицы для снимаемых параметров (так же как и для sd).

source: * |value| = value of height, passage-height or altitude label or point dimensions
ru_ru: * |value| = значение точек height (высота уступа/камина/колодца),\break passage-height (высота хода), altitude (высотная отметка) или dimensions (размеры хода).

source: * |visibility <on/off>| = displays/hides the symbol.
ru_ru: * |visibility <on/off>| = отображает/скрывает символ.

source: * |vthreshold <number> <units>| = threshold for interpreting LRUD readings as left-right-front-back reading perpendicular to the shot.
ru_ru: * |vthreshold <число> <единицы>| = пороговое значение для интерпретации показаний LRUD как показания лево-право-верх-низ, перпендикулярное замеру.

source: * |wall-source <maps/centerline/all>| = set source data for passage wall modeling.
ru_ru: * |wall-source <maps/centerline/all>| = установить исходные данные для\break моделирования стен хода.

source: * |walls <on/off/auto>| = specify if the scrap should be used in 3D model reconstruction * |flip (none)/horizontal/vertical| = flips the scrap after scale transformation * |station-names <prefix> <suffix>| = adds given prefix/suffix to all survey stations in the current scrap.
ru_ru: * |walls <on/off/auto>| = указывает, следует ли использовать скрап в создании 3D-модели. * |flip (none)/horizontal/vertical| = зеркально отображает скрап после\break трансформации масштаба. * |station-names <префикс> <суффикс>| = добавляет префикс/суффикс всем станциям скрапа в текущей съемки.

source: *map area is filled with |color map-bg| *surface bitmaps are displayed if |surface| is set |bottom| *FOR each scrap: outline is filled white *grid is displayed if |grid| is set |bottom| *preview belowAs specified using the |preview| option in the |map| command] is filled with |color preview-below| *FOR each levelLevel is a collection of scraps not separated by a |break| in the |map| command]: BEGIN of transparency FOR each scrap: outline is filled with |color map-fg| FOR each scrap: |area| symbols are filled and clipped to scrap boundary END of transparency BEGIN of clipping by text labels (for all labels in this and upper levels) FOR each scrap: draw all symbols to be clipped (with the exception of |line survey|) ordered from bottom to top draw |line survey| symbols clip to scrap boundary FOR each scrap: draw all symbols not to be clipped (with the exception of |point station| and all labels) ordered from bottom to top draw |point station| symbols END of clipping by text labels FOR each scrap: draw all (point and line) labels (including |wall-altitude|) *preview above is drawn with |color preview-above| *surface bitmaps are displayed if |surface| is set |top| *grid is displayed if |grid| is set |top|
ru_ru: * область карты заполняется |color map-bg|; * растровые изображения поверхности отображаются, если |surface|\break установлен в |bottom|; * ДЛЯ каждого скрапа: абрисы заполняются белым; * рисуется сетка если |grid| установлен в |bottom|; * анонс внизу Согласно спецификации опции |preview| в команде |map|.] заполняется |color preview-below|; * ДЛЯ каждого уровняУровень -- это коллекция скрапов не разделенная |break| в команде |map|.]: НАЧАЛО отсечения ДЛЯ каждого скрапа: абрис заполняется |color map-fg| ДЛЯ каждого скрапа: символы |области| заполняются и отсекаются до границы скрапа КОНЕЦ отсечения НАЧАЛО отсечения текстовых меток (для всех текстовых меток на этом и верхних уровнях) ДЛЯ каждого скрапа: рисуются все символы прошедшие отсечение (за исключением |line survey|), упорядочиваются снизу вверх рисуются |line survey| символы отсекаются границы скрапов ДЛЯ каждого скрапа: рисуются все не отсеченные символы (за исключением |point station| и всех текстовых меток), упорядочиваются снизу вверх рисуются |point station| символы КОНЕЦ отсечения текстовых меток ДЛЯ каждого скрапа: рисуются все (точечные и линейные) текстовые метки (в том числе |wall-altitude|); * анонс рисуется поверх с |color preview-above|; * растровые изображения поверхности отображаются если |surface|\break установлен в |top|; * сетка отображается если |grid| установлен в |top|.

source: *|<id>| = scrap identifier
ru_ru: *|<идентификатор>| = идентификатор скрапа.

source: *|<id>| = survey identifier
ru_ru: * |<идентификатор>| = идентификатор.

source: -100{ List of survey team members with an information how much has each of them surveyed:}
ru_ru: -100{ Список членов исследовательской группы с информацией о вкладе каждого из них в процесс съемки:}

source: 0 $$ |number| $<$ 360.
ru_ru: 0 $$ |число| $<$ 360.

source: 1234.0 Unsurveyed but explored
ru_ru: 1234.0 Не снятая, но исследованная

source: 1244.0 Unsurveyed cave
ru_ru: 1244.0 Не снятая пещера

source: 1em{=cmr10=cmti10{#
ru_ru: 1em{=cmr10=fhari6a{#

source: 2D maps are adapted for particular output scale (level of abstraction, non-linear scaling of symbols and texts)
ru_ru: 2D-карты адаптированы для конкретного масштаба (уровень абстракции, нелинейное масштабирование символов и текстов).

source: 2D maps.
ru_ru: 2D-карты.

source: 3D models.
ru_ru: 3D-модели.

source: : |grade <id> ... [<quantity list> <value> <units>] ... endgrade|
ru_ru: |grade <идентификатор> ... [<quantity list> <значение> <единицы>] ... endgrade|

source: <u0>`<u4>=<u5> <u1>`*=12 <u2>`"=12 <u3>`'=12 defpar{leavevmodeendgraf}
ru_ru: \catcode`\`=\active % \catcode`\*=12 \catcode`\"=12 \catcode`\'=12 \def\par{\leavevmode\endgraf}

source: {5.3}This section applies to old-style font selection using |tex-fonts| command in the initialization file and is obsolete when using |pdf-fonts| command.] Copy an appropriate encoding mapping file with an |*.enc| extension to the |texenc/encodings|, run the Perl script |mktexenc.pl| located in the |texenc| directory and compile Therion.
ru_ru: {5.3}Этот раздел относится к выбору шрифтов старого стиля с использованием команды |tex-fonts| в файле инициализации и устарела при использовании команды |pdf-fonts|.]. Скопируйте\break соответствующий файл сопоставления кодировки с расширением |*.enc| в\break |texenc/encodings|, запустите скрипт Perl |mktexenc.pl| расположенный в\break каталоге |texenc| и перекомпилируйте Therion.

source: E.g. |survey entrance| in the file |entrance.th|.] The points will than be referenced using |@| character---see the |survey| command description.
ru_ru: Например |survey entrance| в файле |entry.th|.]. На точки можно будет ссылаться используя символ |@| -- смотрите описание команды |survey|.

source: Here we're concerned with creating data, so only the two first modes are described in this section.
ru_ru: Здесь мы обсуждаем создание данных, поэтому в этом разделе описаны только два первых режима.

source: If you want some object which is clipped by a scrap boundary to continue to a neighbouring scrap, use |-clip off| option for that object.]
ru_ru: Если вам нужен какой-либо объект, который отсекается границей скрапа, чтобы\break продолжить его на соседний скрап, используйте опцию |-clip off| для этого объекта.].

source: gives the actual shape to abstract map symbols according to map symbol definitions; it creates a lot of PostScript files with small fragments of the cave.
ru_ru: дает фактическую форму\break абстрактным символам карты в соответствии с определениями символов\break карты; он создает много файлов PostScript с небольшими фрагментами\break пещеры.

source: and should search for them on their own.
ru_ru: и должны искать их самостоятельно.

source: In the case of survey stations, XTherion automatically increases the station number for the next symbol inserted.] It is a good idea to start with drawing all survey stations (don't forget to give them names according to real names in the centreline command), than all passage walls followed by all other point symbols, lines and areas.
ru_ru: В случае станций съемки XTherion автоматически увеличивает номер станции для\break следующего вставленного символа.]. Рекомендуется начать с рисования всех станций съемки (не забудьте дать им имена (номера) в соответствии с настоящими именами в команде centreline), далее все хода, за которыми следуют все остальные точечные символы, линии и области.

source: 6pt { ---Arthur C. Clarke, { 1973}} }
ru_ru: 6pt { -- C. Clarke, { 1973}} }

source: { Note:} Therion doesn't use background images in any way unless you assign them to some scrap using |-sketch| option.]
ru_ru: {Примечание:} Therion никак не использует фоновые изображения, если вы не назначили их для определенного скрапа с помощью опции |-sketch|.].

source: {5.3}Strings may contain special tag |<lang:XX>| to separate translations.
ru_ru: {5.3}Строки могут содержать специальный тег |<lang:XX>| для разделения переводов.

source: =93.2mm=12pt { We both step and do not step in the same rivers. {herakl.pdf} 1pt {---Heraclitus of Ephesus, { 6}th/{ 5}th century BC} }
ru_ru: =93.2mm=12pt { Невозможно дважды войти в одну реку. {herakl.pdf} 1pt {---Heraclitus of Ephesus, { 6}th/{ 5}th century BC} }

source: =93.2mm=12pt { There is no royal road to geometry. {euclid.pdf} 1pt {---Euclid, { 3}rd century BC} 10pt { There is no royal road, but there is a road.} 3pt {---Frederick P. Brooks, { 1987}} }
ru_ru: =93.2mm=12pt { Нет царского пути в геометрии. {euclid.pdf} 1pt {\font\tt=fhar6a at 8px \tt ---Евклид, { 3} век д.н.э.} 10pt { Нет царского пути, но есть путь.} 3pt {\font\tt=fhar6a at 8px \tt ---Фредерик П.Брукс, { 1987}} }

source: =cmbx10 =cmr10 =12.5pt #1{{2cm#12cm}}
ru_ru: =fhab6a =fhar6a =12.5pt #1{{2cm#12cm}}

source: =cmr12 =cmti12 =cmmi10 at 12pt =cmbx12 =cmtt12 =cmr10 =cmsy10 at 12pt =cmr8 =cmti8 =cmmi8 =cmbxti10
ru_ru: =fhar6a at 12pt =fhari6a at 12pt =cmmi10 at 12pt =fhab6a at 12pt =cmtt12 =fhar6a at 10pt =cmsy10 at 12pt =cmr8 =cmti8 =cmmi8 =cmbxti10

source: =cmssdc10 at 16pt =cmssdc10 at 12pt
ru_ru: =fhab6a at 16pt =fhab6a at 13pt

source: A degree value may be entered in decimal notation ($x.y$) or in a special notation for degrees, minutes and seconds ($deg[{:}min[{:}sec]]$).
ru_ru: Значение градуса может быть введено в десятичной системе ($x.y$) или в специальной нотации для градусов, минут и секунд ($deg[{:}min[{:}sec]]$).

source: A good idea is to start a transaction before loading this file, if database doesn't start a transaction automatically.) It's important to set-up database encoding to match the one specified in Therion |export database| command.
ru_ru: Хорошая идея -- начать транзакцию перед загрузкой этого файла, если база данных не запускает транзакцию автоматически). Важно настроить кодировку базы данных так, чтобы она соответствовала той, которая указана в команде экспорта базы данных Therion'а -- |export database|.

source: A map is a collection of either scraps or other maps of the same projection type.
ru_ru: Карта представляет собой набор либо скрапов, либо других карт одного и того же типа проекции.

source: A shortcut for all this is Ctrl-p.
ru_ru: Сочетание клавиш для\break этого -- Ctrl-p.

source: A simple example is
ru_ru: Простой пример:

source: A special case is when |<point1>| and |<point2>| are scrap IDs---than the closest scrap ends are joined together.
ru_ru: Частным случаем |<точка1>| и |<точка2>| могут быть идентификаторами скрапов, более близкие концы скрапов соединяются вместе.

source: A synonym term `centerline' may be used.
ru_ru: Можно использовать синоним `centerline'.

source: A very simple example would be
ru_ru: Очень простой пример:

source: A strong wind from breakdown
ru_ru: A сильная тяга из разлома

source: Absolute loop error is ${ x^2+ y^2+ z^2}$, where $ x$ is the difference between the identical start and end points of the loop before the error distribution measured along the $x$ coordinate axis; similarly for $y$ and $z$.
ru_ru: Абсолютная ошибка кольца равна ${d_x^2+d_y^2+d_z^2}$, где $d_x$ разность между\break одинаковыми начальными и конечными точками кольца до распределения ошибок, измеренная вдоль оси координат $x$; аналогично для $y$ и $z$.\break

source: Actually, only a subset of the Therion commands are used in the Map editor: multi-line |scrap ... endscrap| commands which may contain |point|, |line| and |area| commands.
ru_ru: На самом деле в редакторе карт используются только несколько команд Therion'а: многострочная команда |scrap ... endscrap| может содержать команды |point|, |line| и |area|

source: Add the line
ru_ru: Добавьте строчку

source: Add your translations at lines beginning with `|xx:|'.
ru_ru: Добавьте свои переводы в строки,\break начинающиеся с `|xx:|';

source: Additional tools.
ru_ru: Дополнительные инструменты.

source: Additionally XTherion supports XVI (XTherion vector image) format, which displays centreline and LRUD information on the background, and PocketTopo data exported in Therion format (see below).
ru_ru: Кроме того,\break XTherion поддерживает XVI (XTherion vector image), в котором отображается нитка хода и LRUD, и данные PocketTopo экспортируются в формат Therion'а (см. ниже).
